app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."category_id" = $1  [["category_id", 1]]
---
  def show
    @category = Category.find(params[:id])
    @recipes = @category.recipes.all